{
	"exhibits" : [
		{	"id" : "0",
			"title" : "History Gallery",
			"icon" : "historyGallery",
			"subExhibits" : [
				{
					"id" : "0",
					"title" : "Leonardo's Robot",
					"icon" : "leonardoRobot",
					"video" : "link",
					"description" : "Built by Leonardo Da Vinci in 1495, the robot was a humanoid automaton. The robot is clad in medieval armour that resembles the armoury of Germany and Italy. Several sketchbooks were discovered in the 1950s that demonstrated design notes of the robot."
				},
				{
					"id" : "1",
					"title" : "Clockwork Prayer",
					"icon" : "clockworkPrayer",
					"video" : "link",
					"description" : "Built in 16th century, this mechanical masterpiece was designed and built by the consummate clockmaker, Juanelo Turriano. The clockwork monk is a self-acting device and all its mechanisms are hidden under its clock. Created as a symbol of religion, it is a true tribute to human ability today."
				},
				{
					"id" : "2",
					"title" : "Karakuri",
					"icon" : "karakuri",
					"video" : "link",
					"description" : "This robot is embedded in the tradition of Karakuri, known for concealing technology and evoking emotions in people. Karakuri puppets were the beginning of Japan's love and passion for robots and technology. These puppets use subtle hand movements that are often abstract and do not have any reason or logic behind them."
				},
				{
					"id" : "3",
					"title" : "Automaton_Trumpet_Player",
					"icon" : "trumpetPlayer",
					"video" : "link",
					"description" : "Designed in 1810 by Johann Friedrich Kaufmann, the trumpet player is still on display today in Deutsches Museum, Munchen. It is the figure of a man wearing a Spanish costume. His lungs are represented by leather bellows that imitate the sound of a trumpet."
				},
				{
					"id" : "4",
					"title" : "Maria_Maschinenmensch_Metropolis",
					"icon" : "maria",
					"video" : "link",
					"description" : "Maschinenmensch is German for machine person. It is a one-of-a-kind robot, based on the character of Maria from the cult classic, Metropolis. It was created by Rotwang based on Marias character in the novel and the film."
				},
				{
					"id" : "5",
					"title" : "Unimate",
					"icon" : "unimate",
					"video" : "link",
					"description" : "Unimate was the first ever industrial robot that was put into use . It worked in production on a General Motors assembly line in New Jersey. The robot was built in the 1950s by George Devol. It was created to work on machinery, especially handling apparatus and controlling them."
				},
				{
					"id" : "6",
					"title" : "Dalek_Dr.Who",
					"icon" : "dalek",
					"video" : "link",
					"description" : "The Daleks are a fictional race of mutants as seen on the popular british TV series, Dr. Who. Daleks were portrayed as extremely violent, pitiless and merciless cyborg aliens, taking inspiration from the Nazis. This is why this robot possesses characteristics that instil fear in everyone."
				},
				{
					"id" : "7",
					"title" : "WABOT_1",
					"icon" : "wabot1",
					"video" : "link",
					"description" : "WABOT 1 is an anthropomorphic robot developed by Ichiro Kato at the Japanese Waseda University and released in 1970. It is short for Waseda Robot and is the intelligent predecessor of WABOT 2. This robot known for its human-esque characteristics works on a vision and limb control system. It can even talk in Japanese."
				},
				{
					"id" : "8",
					"title" : "KUKA",
					"icon" : "kuka",
					"video" : "link",
					"description" : "Jakob Knappich and Joseph Keller built the first Kuka robot in 1898 with the purpose of providing cost-effective illumination. The Kuka Automation Company aims to empower industries by equipping them with a multitude of innovative robotics. Kuka Robotics has changed the face of robotics."
				},
				{
					"id" : "9",
					"title" : "The_Silver_Arm",
					"icon" : "silverArm",
					"video" : "link",
					"description" : "David Silver from MIT was the primary creative head and developer behind the Silver Arm. This enhanced robotic arm was created to mimic human-like motions like finger and hand movements using distinct motor control. The Silver Arm is a testament of automation."
				},
				{
					"id" : "10",
					"title" : "Star_Wars",
					"icon" : "starwars",
					"video" : "link",
					"description" : "Star Wars is a classic that has gained fan following among both scientific and non-scientific communities. From R2-D2, C-3PO to BB8, Star Wars has a dense history of robots with an innate ability to replicate humans."
				},
				{
					"id" : "11",
					"title" : "Delta_Pick_&_Place_Robot",
					"icon" : "delta",
					"video" : "link",
					"description" : "Delta robots are parallel robots and consist of three arms that are connected at the base to universal joints. Parallelograms are used to maintain perfect orientation. Delta robots are used in factories and industries due to their speed in picking and packaging and can perform 300 picks or more in a minute."
				},
				{
					"id" : "12",
					"title" : "Direct_Drive_Arm",
					"icon" : "directDrive",
					"video" : "link",
					"description" : "The Direct Drive Arm was designed and built by Takeo Kanade. Direct Drive Robotic Arms are the best method designed till date for mechanical arms as there are no transmission mechanisms involved between the loads and the motors allowing them to move smoothly and provide high-speed precision in robots."
				},
				{
					"id" : "13",
					"title" : "SCARA",
					"icon" : "scara",
					"video" : "link",
					"description" : "SCARA is the acronym for Selective Compliance Assembly/Articulated Robot Arm. It was created in 1981 under the guidance of a professor named Hiroshi Makino. It is effective for a variety of assembly operations due to its cleaner and faster motion such as loading/unloading, packaging, pick & place, etc."
				},
				{
					"id" : "14",
					"title" : "Ribert_Hopper_Robot",
					"icon" : "ribertHopper",
					"video" : "link",
					"description" : "Raibert Hopper earned its name because of its one leg. It can be considered proof that robots might be agile like human beings and walk or run someday. This is why Raibert Hopper is considered a milestone in the history of robotics."
				},
				{
					"id" : "15",
					"title" : "WABOT_2",
					"icon" : "wabot2",
					"video" : "link",
					"description" : "WABOT 2 was developed by Waseda University in Japan in 1984 and perfectly mimicked the movements of a human hand. This robot possesses anthropomorphic characteristics. WABOT 2 is a humanoid that accomplishes artistic activities such as playing keyboard instruments. The developers , Sumitomo Electric Industries Ltd. demonstrated it at Expo 85."
				},
				{
					"id" : "16",
					"title" : "Jhonny_Five",
					"icon" : "johnny",
					"video" : "link",
					"description" : "Short Circuit is a popular Action/Comedy movie directed by John Badham. The plot of the film revolves around an experimental military robot. This robot is struck by lightning in the movie after which it gains a human-like intelligence."
				},
				{
					"id" : "17",
					"title" : "Sojourner_Rover",
					"icon" : "sojourner",
					"video" : "link",
					"description" : "The Sojourner Mars Rover was a part of the Mars Pathfinder mission conducted by NASA with the aim to get science equipment to Mars. Sojourner had to study the Mars terrain and record the performance of the micro vehicles such as wheel-soil interaction, autonomous driving performance, power generation and thermal control."
				}
			]
		},
			{	
				"id" : "1",
				"title" : "Botulity Gallery",
				"icon" : "link",
				"subExhibits" : [
					{
						"id" : "0",
						"title" : "Packbot_Replica",
						"icon" : "link",
						"video" : "link",
						"description" : "Terrain robots are robots that are used for surveillance, research & surveying and other tasks where the terrain is difficult to move through, such as thick forests or uneven rocks. These are rugged robots that are made to operate under rough conditions. They are typically used by the military as they are small enough to reach places where soldiers cannot or should not go, or in search and rescue operations. Be it a battleground or a collapsed mine, it is important to have situational awareness under such critical conditions. This information can be leveraged by soldiers, combat engineers and explosive ordnance disposal (EOD) technicians to safely navigate through these extreme conditions and take an informed decision. These bots are usually equipped with multiple cameras with night-vision and a large capacity for zooming. A manipulator with an arm and a gripper may also be mounted on a rotatable turret, allowing them to pick or move objects and collect samples."
					},
					{
						"id" : "1",
						"title" : "Da_Vinci_Surgical_System",
						"icon" : "link",
						"video" : "link",
						"description" : "Robot doctors may sound too futuristic, but robot-assisted surgery through da Vinci system is a commonplace today. More than 1,700 da Vinci systems are already installed in hospitals worldwide. Since the FDA approval in 2000, more than 3 million minimal invasive surgeries have been performed with da Vinci systems and a new one begins every 42 seconds. Three out of four prostate cancer surgeries in the U.S. are performed using the da Vinci Surgery. Components of the da Vinci Surgical System: Surgeon Console: The console is where the surgeon gets seated comfortably while viewing a high-definition, 3D image inside the patient’s body. The master controls below the display translate the surgeon’s hand, wrist and finger movements into precise, real-time movements of the surgical instruments. Patient Side Cart: This is where the patient is positioned during the surgery and includes multiple robotic arms that function according to the surgeon’s commands. Endowrist Instruments: The surgeon has access to a full range of Endowrist instruments during the operation. These instruments are designed with seven degrees of motion, far better than the human wrists. Vision System: Equipped with high-definition 3D endoscope and an image processing unit, the vision system offers realistic images of the patient’s body. There is also a widescreen view which provides surgical assistant near the patient-side a broader visualization of the on-going procedure."
					},
					{
						"id" : "2",
						"title" : "Packbot_Explorer",
						"icon" : "link",
						"video" : "link",
						"description" : "The modern society mandates taking every possible measure to avoid hazards, yet tragedy can strike at any time. Mine collapses, earthquakes, fires, there are many unfortunate events that are beyond our control. In that situation, all we can do is be prepared for rapid recovery of the lives at stake. Search and Rescue is the application of robotics that is dedicated to locating casualties in such disasters and initiating rescue operations. Combining various different technologies and machines, we can reduce the loss of life and attend to the casualties caused by such events. These operations commonly involve all terrain robots to move through the rubble and reach areas where it would be hazardous for a man to go. Without taking any further risks, these bots allow us to reach the affected in a timely manner. Traditionally, dogs have been used for search operations. This was an effective way of searching in the past as dogs have a superior sense of smell. However, there are situations where even dogs can’t help. For example, when the operation has to be carried out in water bodies. Other scenarios include war casualties, mountain rescue and cave rescue. In cases where the distressed are cut off from the mainland, they can be located and provided with water and supplies. Use of robotics has significantly improved the survival rates in such cases. Future developments could further improve the results of search and rescue operations, and save many precious human lives."
					},
					{
						"id" : "3",
						"title" : "Inmoov_Robot",
						"icon" : "link",
						"video" : "link",
						"description" : "They have various sensors and scanners that they use to study everything around them. The data that they collect is then transmitted to earth for research. The biggest advantage of Space Robots is that they are disposable. Once they are deployed on their mission, they will remain operational for years and will only stop when the core components are damaged. The Space Mechanic : Sometimes space shuttles or space stations require construction and repair work. However, having a person do this could lead to all sorts of hazards. Exposure to radiation and extreme temperatures could be fatal to humans. This is a perfect example of a task that a robot would do with relative ease, factoring in all the risk involved."
					},
					{
						"id" : "4",
						"title" : "ABB_IRB_1200_&_Milagro_Oysterbot",
						"icon" : "link",
						"video" : "link",
						"description" : "Precision and industrial robots are used in a variety of industrial processes ranging from packaging to manufacturing. Precision robots are made to work within very tight tolerances. They use sensors to ensure that they are always on track. Industrial robots are commonly seen in heavy mechanical applications where they work alongside humans or work independently. Industrial robots are tailor-made for the function at hand. They are used in welding, painting and even heavy lifting.  Hence each robot is distinct in its own regards. Precision and industrial robots use actuators and motors to expand their degrees of motion based on what they are required to do. Robots in Action : Accuracy and precision are not the same. Precision robots deal with repeatability rather than getting close to the real value. Hence, precision robots are used to recreate a process multiple times without changing the output measurements. Precision robots are used extensively in the electronics industry. Industrial robots are robust in their construction. Their movements are programmed using numerical coordinates. Automotive industry a prime example where Industrial robots are employed extensively."
					},
					{
						"id" : "5",
						"title" : "Swash",
						"icon" : "link",
						"video" : "link",
						"description" : "Household chores are tasks that are important for a healthy life but take up time and energy. They often get neglected, particularly in the case of coming generations.Tasks such as mopping or cleaning could even cause muscle fatigue and in some cases, sprains. It is therefore natural to expect applications of robotics in housekeeping. While machines such as automatic washing machines, dishwashers, etc., have been around for a long time, several other devices meant for housekeeping tasks are seeing adoption by the society today. Machines are now sophisticated enough to operate without much supervision. By making use of the latest technologies, they can navigate their way around the house, perform the tasks they’re programmed for, and alert you for refills, recharge, etc. This is the case with the OysterBot, the current state of the art floor vacuum cleaner. It is the fastest cleaning bot in India and provides the longest battery life. It comes with a water tank that is used for wet cleaning. Swash, on the other hand, is a dry cleaning robot that can clean and iron your clothes within 10 minutes without using any external agents such as water or petroleum based solvents. This increases the life of your clothes while saving time and money as well."
					},
					{
						"id" : "6",
						"title" : "DJI_Matrice_100",
						"icon" : "link",
						"video" : "link",
						"description" : "Robotics is redefining the agriculture industry and is enabling farmers to efficiently meet the growing demands of global food shortage and labour. Robots, specifically in the form of drones offer an unparalleled advantage to farmers in terms of better production, crop monitoring and overall farming efficiency. Unlike ordinary drones, these sophisticated Unmanned Aerial Vehicles (UAVs) are fitted with high-resolution cameras and enhanced sensors that map the ground and provide accurate soil data to farmers in real-time. To maintain optimum altitude and flight control, agricultural drones also sport flight controllers along with a responsive propulsion system. From crop monitoring to planting, livestock management, crop spraying, irrigation mapping, and more, agricultural drones have a promising future in the world’s largest industry. A Bird’s Eye View : The remarkable aspect about agricultural drones is that they offer farmers a clear picture about their fields. Utilizing a mix of sensors and digital imaging capabilities, these drones can reveal issues related to irrigation, soil variation, pest and fungal infestations, which are not always clearly visible to the naked eye."
					},
					{
						"id" : "7",
						"title" : "Insect_Bots",
						"icon" : "link",
						"video" : "link",
						"description" : "Robots that are less than 1mm in size are known as microbots. The initial research on these robots was done in the 1970’s by the U.S. Intelligence agencies. This classified research was to analyse their possible usage in rescue assistance and electronic intercept missions. Today, the three major areas of research in this field are power supply, flight and the use of “robot swarms”. Robot swarms are swarms of microbots that work in unison to achieve specific goals. They use signals such as the WiFi to coordinate their movements. Developers are making use of biomimetics to overcome the challenges they face in applying the “macro” technologies to microscopic robots. Biomimetics refers to the imitation of natural systems to solve human problems and often finds implementations in technology. For example, biological motors can be used as power sources for these tiny robots, which can not carry large batteries for power supply. The popularity of microbots as toys has grown significantly in the past years, with brands like Hexbug providing many child friendly microbots. These are fascinating machines but there are many potential applications that they can have with future developments. These robots can have a huge application in search and rescue operations. There is still tremendous research scope for such robots."
					},
					{
						"id" : "8",
						"title" : "Sanke_Robot_Miniature_Unmanned_Ground_Vehicle_Hexapod_Quadrapod",
						"icon" : "link",
						"video" : "link",
						"description" : "Driven by the current military scenario that demands the use of unmanned systems that can operate autonomously under different environmental conditions, the application of robotics in defence has seen a tremendous growth over the years. DRDO, our country’s premier R&D organization has demonstrated the use of robotics technologies through a wide range of robots that are capable of performing mission-critical tasks with minimal human intervention. Robots operating in a battlefield scenario are often required to traverse uneven terrains and should possess different sensing capabilities in order to intelligently achieve the mission objectives. To achieve such a feat, DRDO robots employ a wide range of locomotion and manipulation technologies underpinned by Artificial Intelligence (AI). Snake Robot : This rugged robot is made up of 14 active joints that offer whole body locomotion. A colour camera mounted in its hood offers video feedback to the operator. Miniature Unmanned Ground Vehicle (MINIUGV) : This remotely-controlled portable robot is capable to move over rough terrains with a maximum speed of 3 Km/h. The 28 Kg robot is capable to carry additional payload of 50 Kg over a flat terrain and consists of a daylight camera, making it a perfect choice for counter-insurgency operations. Legged Robots : These six (Hexapod) and four legged (Quadruped) robots have three degrees of freedom that provide them with omni-directional motion capability. Equipped with ultrasonic sensors for obstacle detection and avoidance, these legged robots demonstrate human-like stable locomotion. The Quadruped further comes with additional actuated wheels that provide a hybrid locomotion capability."
					},
					{
						"id" : "9",
						"title" : "Eksowest",
						"icon" : "link",
						"video" : "link",
						"description" : "Robotic limbs and wearable robots are inventions that have a direct impact on humanity. Their importance is widely acknowledged as a result of the contribution of popular cinema. The loss of a limb due to accidents, war casualties or cardiovascular disease is one of the most painful experiences for a human. Robotics gives amputees a chance of recuperating their limbs and being able to get back to their lives. Robotic prosthetics require multidisciplinary research, primarily making use of electronics, mechanics and biology. Several technologies have been developed to implement this concept and we are not too far from commercially available robotic prosthetics. This research can further be applied to the creation of devices like exoskeletons that enable humans to go beyond their capabilities and achieve physical strength and dexterity that can only be defined as super-human. Tagged as one of the “50 best innovations of 2010” by TIME magazine, the EksoVest by Eksobionics is one such invention that helps workers operate more efficiently by reducing fatigue. Use of such devices also reduces the chances of injury. The EksoVest uses physics to shift the weight from your arms and shoulders to your legs. This machine is being actively tested at companies such as Ford. It can be of great assistance to mechanics who have to deal with muscle fatigue on a daily basis. Myoelectric systems are used to read the brain signals from the nerves of the damaged organs and activate motorized limbs in accordance. 3D printed prosthetics are used to reduce the weight of a myoelectric system and provide better personalization."
					}
				]},
				{	"id" : "2",
					"title" : "INDOBOTS Gallery",
					"icon" : "link",
					"subExhibits" : [
						{
							"id" : "0",
							"title" : "Chandrayaan_2_Rover",
							"icon" : "link",
							"video" : "link",
							"description" : "Launched in 2019, Chandrayaan-2 was India's planned second mission to the moon. Delegates of Roscosmos and ISRO consented on an agreement on 12th November 2007, for the two agencies to coordinate together on the Chandrayaan-2 Project. India chose to build up the lunar mission autonomously when Russia refered to its failure to give the lander even by 2015. To conduct further tests on the vehicle, the spacecraft's launch was first deferred which had been scheduled for March 2018.  After the program's fourth Comprehensive Technical Review meeting, on 19 June 2018, various changes in design and landing succession pushed the launch to the first half of 2019. Initially scheduled for 14 July 2019, Chandrayaan-2 launch was however prematurely ended due to a technical glitch. ISRO announced 22 July 2019, 09:13 UTC (14:43 IST) as new time of launch, on 18 July. Chandrayaan-2 comprises of an orbiter which will perform mapping from an altitude of 100 kilometres (62 miles), a lander (Vikram) will make a soft landing on the surface, send out the rover (Pragyan) and will land near Moon’s South Pole, a triumph not accomplished before by any other mission. Chandrayaan-2 stack was first put in an Earth parking orbit of 170 km perigee and 40,400 km apogee by the launch vehicle. It then performed orbit-raising operations followed by trans-lunar injection using its own power. The lander was to have the tricolour and one rover-wheel will have the Ashoka Chakra on it. The principal purpose of Chandrayaan-2 is to exhibit the capacity to soft-land on the lunar surface and work a robotic rover on the surface. Examinations of lunar topography, mineralogy, elemental abundance, the lunar exosphere, and signatures of hydroxyl and water ice are incorporated in scientific goals. The mission carries 13 Indian scientific instruments for experiments. Imaging of rock will be done to discover components like magnesium, calcium and iron and also for signs of water. Mission will likewise examine the exosphere of the moon. A NASA instrument for Laser ranging will be carried by the mission as a mark of cooperation between the two space agencies. India will use the Deep Space Network of NASA on payment basis for navigation and guidance. ISRO has affirmed that it is expecting to find water on the lunar surface on the back of ‘the thousands of tests’ conducted by the agency. Chandrayaan 2's Rover was a 6-wheeled robotic vehicle named Pragyan. The word translates literally as wisdom. The name is aptly given to the robot made to study the moon, which is said to be the oldest undisturbed record of the history of our solar system. It is capable of generating 50 W of energy using solar power, which is enough to sustain it's basic functions. Even though several setbacks were met during the operation due to communication failure with the lander, the mission is said to be a 95% success as the orbiter was able to record important information that will be useful for our scientists in their understanding of space, and our clostest heavenly body, the moon."
						},
						{
							"id" : "1",
							"title" : "Team_Indus_Rover",
							"icon" : "link",
							"video" : "link",
							"description" : "Bengaluru-based private aerospace firm Team Indus is part of a consortium that has bagged a contract from US space agency NASA to design and build a lander for its next lunar mission in 2020. Established in 2010 by Rahul Narayana, Team Indus was a finalist for the $30 million Google XPrize Lunar Prize competition. Group Indus has the support of Infosys, Ratan Tata and Flipkart founders Sachin and Binny Bansal. By April 2018, TeamIndus was moving in the direction of building up the equipment and propelling the mission in 2019, perhaps in organization with Synergy Moon. In 2018, Antrix Corporation, the commercial arm of Isro, ended a concurrence with Team Indus for launch services. Team Indus was planning to land a spacecraft and rover on the moon, however couldn't acquire money to procure a rocket. The lander was initially code-named HHK1, and their single rover is called ECA, a shortened form for Ek Choti Si Asha (A Small Hope). The spacecraft has a liquid rocket engine with a thrust capability of 440 N for deceleration, and sixteen small 22 N thrusters for finer orbital maneuvers and attitude control (orientation). Then the lander would perform a soft landing at a location yet to be determined. NASA chose three commercial moon-landing service providers to deliver science and technology payloads under Commercial Lunar Payload Services (CLPS) as a feature of the Artemis program. The structuring of the 21st century lunar lander is NASA's new mission and the expense of the task is assessed to be over $250 million. Astrobatic, Intuitive Machines, and Orbit Beyond are the three companies which have received contracts. Orbit Beyond has hired Team Indus for equipment design and construction. Orbit Beyond, which a received $97 million contract, has proposed to fly as many as four payloads to Mare Imbrium, a lava plain in one of the Moon’s craters, by September 2020. In late 2018, Team Indus (Axiom Research Labs) partnered with OrbitBeyond that bid and won a NASA CLPS award to land several commercial payloads on the Moon. The lander was renamed Z-01 and is planned to be launched on Q3 2020 possibly on a Falcon 9 rocket and land at Mare Imbrium (29.52º N 25.68º W)."
						},
						{
							"id" : "2",
							"title" : "Dosa_Making_Robot",
							"icon" : "link",
							"video" : "link",
							"description" : "Dosa is a manually made dish, popular from the southern part of India. But, Bangalore-based Mukunda Foods changed the way this delicious dish is prepared. Mukunda Foods Private Limited, incorporated in 2012, is a kitchen robotic company headquartered in India’s IT city of Bengaluru. Their first product Dosamatic, is the world’s first automatic table top dosa making machine, a stellar success in the domestic as well as international markets. Mukunda Foods is probably the first company to install a dosa making machine inside a naval ship, INS Jyoti. In 2011, Eshwar (Co-founder and CEO, Mukunda Foods) along with his friend Sudeep Sabat (Co-founder and COO, Mukunda Foods) set out to make a Dosa Robot which could make dosas at the touch of a button. They got chosen for the incubator when they pitched their idea to Indian Angel Network which helped them refine the product. In October, 2013, IAN invested in Mukunda Foods. This round of investment was led by IAN investors Hari Balasubramaniam and P Gopinath which acted as the catalyst in flourishment of the robot. Dosamatic is world’s first table top machine. Just place it on table, switch on the plug and the machine is ready to serve you. On press of a button, the machine disperses the batter, spreads it, applies oil, and cooks it in just 60 seconds. This means that with 60 dosas, Dosamatic Machine offers impressive turnout of dosas every hour. Later, any filling as per preference can be added. It offers the opportunity of cooking more than 99 varieties of dosas. It also has auto-clean feature to free you from hassles of maintenance. Dosamatic functions on 3K-Watt 1-Phase 220V and hence is energy friendly. Archimedes’ screw system is used to pump the batter onto the hot plate. The principles of a side-stand of a motorcycle are put to practice when the machine has to interchange from spreading batter to peeling the cooked Dosa. Smilarly, Rotimatic is a robotic roti maker manufactured by Zimplistic. It is the world's first and fully automatic flatbread maker that makes rotis, chapatis, puris, pizza bases, and tortillas in less than 90 seconds. Introduced to the world during CES 2019, BreadBot by Wilkinson Baking Company is another robot that can mix, form, proof and bake ten loaves of bread an hour."
						},
						{
							"id" : "3",
							"title" : "ARYA",
							"icon" : "link",
							"video" : "link",
							"description" : "Arya is a new tool that has been developed as well as modeled by the team of DTU-AUV. It is an Autonomous Underwater Vehicle or AUV. The team who worked on this project consists of undergraduate students of the Delhi Technological University (DTU) in India from varied multidisciplinary backgrounds. This team of students also participated in the SAUVC or the Singapore AUV Challenge that is backed by IEEE. ARYA can easily be known as one of the most significant engineering feats in the present times. ARYA’s mechanical system mostly includes the watertight hulls and the structural framework that house the on-board electronic system. The rationale that has been provided behind this design methodology is to design a stable vehicle that has positive buoyancy and can help in operating as well as modeling the AUV’s control system. This is accomplished by ensuring the desired aspect ratio of the hydrodynamic stability as well as placing all the components optimally to maintain the required positions of buoyancy and the center of gravity. In addition to that, the AUV has an open-frame structure so that it can reduce the drag force it experiences effectively. It is also noteworthy that the AUV has an acrylic framework that supports all its subsystems robustly. Moreover, the frame’s design complies to the development of a lightweight structure while ensuring its structural strength at the same time. This choice for the material has been made due to its mechanical properties like corrosion-resistance and strength-to-weight ratio. Furthermore, the modeled design has also been analyzed critically to understand its structural performance better when the vehicle is at greater depths. In the same vein, the emphasis has also been laid on the safety factor and induced stresses. ARYA’s cutoff circuit has also been designed with the safety of electronic circuits and batteries in mind. Moreover, it consists of MOSFETs, diodes, relays, and comparators. The diodes in the circuit are employed to prevent back current from entering the batteries. Also, two comparators are employed to keep the battery voltage of the AUV between the minimum threshold and the maximum. Thanks to the 3S Li-Po batteries of the AUV, one of the two comparators have been set to 3.7V (minimum threshold) and 12V (maximum threshold). In addition to that, the combination of relay and MOSFET act as the switch of the vehicle, ensuring that its battery gets disconnected whenever it malfunctions. The relay and MOSFET are selected according to the current that is needed by the power distribution board and electronic circuits, i.e., around 30A. ARYA’s design can be regarded as the result of a commitment and dedication to develop a robust yet compact-cum-lightweight vehicle. It meets the industrial standards when it comes to its eco-friendliness and safety to function effectively in shallow water as well as a 5-25 meters depth range. ARYA’s development offers a favorable platform to advance even further as well as improvise the vehicle by integrating different advanced sensors to enhance the application of the AUV in detecting and monitoring the marine structures and habitat."
						},
						{
							"id" : "4",
							"title" : "DTU_UAV",
							"icon" : "link",
							"video" : "link",
							"description" : "An Unmanned Aerial Vehicle (UAV), also known as an Uncrewed Aerial Vehicle, are elements of a UAS or an Unmanned Aircraft System. These systems comprise a ground-based controller, a UAV as well as a system of communication that is carried out between the two. In addition to that, the flight of these UAVs might function with different degrees of autonomy. They can either be controlled by a human operator using a remote control or by onboard computers autonomously. As opposed to crewed aircraft, unmanned aerial vehicles were used originally formissions that were too dirty, dangerous or dull for humans. These UAVs mostly originated in military applications initially. That said, today, their use has expanded to scientific, commercial, agricultural, recreational as well as a host of other applications.   These   UAVs   are   also   used   for   policing   and   surveillance,   aerial photography, drone racing, smuggling, and product deliveries. In fact, civilian UAVs now outnumber military UAVs vastly. According to estimates, over a million UAVs were sold for civilian purposes only by 2015. UAVs have descended mainly from target drones. As discussed above, they areRemotely Piloted Vehicles (RPVs) that were originally employed by the militia ofseveral countries following World War II. Moreover, modern UAVs were mostlydebuted as an essential weapons system by military forces in the early 1980s. Thistook place when the Israeli Defense Forces first fitted small drones with infraredcameras and trainable television. These drones resembled large model airplanesand also came with target designators meant for laser-guided munitions. Thesewere downlinked to a remote control station. These drones were mostly undetectable due to their quiet engines and small size,which   is   why   they   proved   to   be   rather   effective   in   target   designation   andbattlefield surveillance. Many other armed forces also learned from the success ofthe Israeli forces. For instance, the US bought some early Israeli models and alsoproduced these drones under license. In this regard, the most crucial tactical UAVin the United States is the MQ-1 Predator. It first flew in the year 1994. The Predator has a length of 8 meters as well as a wingspan of 12.5 meters. It canfly at 130 km per hour. Moreover, it has an endurance of a good 24 hours. Alongwith its infrared and visible television, it also carries passive electronic sensorsand a synthetic aperture radar. In the same vein, it can even carry anti-tankmissiles.   Its   sensor   outputs   and   control   inputs   are   transmitted   throughcommunications satellite. Hence, the Predator was a significant achievement forthe US during that time. Therefore, as is evident, UAVs are futuristic gadgets that have a plethora ofapplications. Avniel is another impressive UAV as far as its technical specificationsare concerned. The airfoil used for its wing is S1210, and the aspect ratio of thewing is 7. Its gross takeoff weight is 7.9 kg, and its payload is 3.5 kg. Its wingspanor the maximum extent, measured from tip to tip, across its wings is 2 m. Itstakeoff distance is 60 ft, and its cruise speed is 13 m/s. It comes with a multitude ofother promising specifications. The features of Avniel include human tracking,autonomous   landing,   autonomous   takeoff   by   following   the   given   waypoints,autonomous payload delivery and human detection over 100 ft. Moreover, it has analuminum and birch wood framework. This drone or UAV, in addition to all the others, promise some interesting anduseful applications in a number of fields and industries across the globe."
						},
						{
							"id" : "5",
							"title" : "ISRO_STUDSET",
							"icon" : "link",
							"video" : "link",
							"description" : "ISRO STUDSAT : StudSat is essentially a CubeSat satellite that has been designed by a group of students. The project was managed and conceptualized by undergraduate students who come from different parts of India. Moreover, StudSat-1 is a miniaturized, picosatellite that was launched successfully on July 12th, 2010 into the synchronous orbit of the sun from the Satish Dhawan Space Center. The objective of the mission was for students to get a hands-on experience of the fabrication, realization, and design of a real space mission at minimum costs. The mission was largely experimental in nature, and its life was six months. StudSat-1 can easily be called the first picosatellite as well as the smallest one that was launched by the country or any Indian organization for that matter. This project was started by a team of four students who came from varied engineering colleges of Bangalore and Hyderabad. These students attended the International Astronautical Congress held in Hyderabad in 2007 and met with Mr. D.V.A. Raghavamurthy, the Project Director of small satellites at ISRO Satellite Congress. From there on, the team expanded steadily and ultimately completed the conceptual design of the satellite. The students went to the management of their colleges for sponsorship after the financial budget analysis. In turn, the colleges approached ISRO for a preliminary review of their project. Scientists from ISRO approved this preliminary design review after a set of meetings by the students that consisted of detailed presentations. Thereafter, the initial team of four members expanded to a whopping 45 students who came from 10 distinct colleges. In addition to that, seven of those colleges also formed a consortium in order to offer the financial sponsorship that was needed for the project to begin. Dr. Jharna Majumdar leads the project team as the Project Coordinator. Today, StudSat is placed successfully in the orbit of the sun. It even received its first signal on July 12th, 2010 at 11:07 IST. Talking about its design, the satellite largely resembles a rectangular cube that is small in size. Its dimensions are 1o cm x 10 cm x 13.5 cm. Moreover, it weighs 950 g approximately with a volume of 1.1 liters. It is also pertinent to mention here that the satellite was launched successfully in the sun-synchronous orbit of 700 km. The satellite performs the application of a remote-sensing satellite. It takes pictures of the surface of the earth with a 90-meter resolution. It is noteworthy that this is the best achievement to date by any satellite across the world in the “PICO” category. Moreover, the satellite consists of a host of subsystems such as a mechanical structure, a communication subsystem, Payload (Camera), a distribution and power generation subsystem, an on-board control and determination subsystem, etc. The students working on the project have ingeniously designed these subsystems. Furthermore, a Ground Station has also been designed to communicate effectively with the satellite. NMIT established this Ground Station or the NASTRAC (Nitte Amateur Satellite Tracking Center). It was inaugurated by ISRO’s then chairman, Dr. K. Radhakrishnan."
						},
						{
							"id" : "6",
							"title" : "ideaForge_Netra",
							"icon" : "link",
							"video" : "link",
							"description" : "ideaForge Netra : The DRDO Netra can be defined as an Indian autonomous and lightweight UAV used for reconnaissance and surveillance operations. It has been developed jointly by the Research and Development Establishment (R&DE) of the Defence Research and Development Organization and a private firm based in Mumbai known as ideaForge. The Netra can be defined as a lightweight UAV that has been built using carbon fiber composites that use quadcopters to control and provide lift. This gives it a VTOL capability. Moreover, it has absolutely no moving parts besides its motors, transmissions, and rotors. Hence, it needs very low maintenance. It is also pertinent to mention here that the carbon fiber that is used in its making results in a lightweight product that weighs only 1.5 kg. This makes the Netra super portable. Moreover, with a backpack case, operators can carry the system easily to field locations in order to serve as their base station. The Netra also comprises a military-grade controller, communication systems, a power supply as well as a handheld operator console. Furthermore, the Netra can also be launched easily from a small clearing. It has the ability to fly a distance of more than 2.5 km when measured from its take-off point. The UAV’s operational altitude is 200 m. Using an on-board wireless transmitter, the Netra can also carry out surveillance single-handedly in an area of 1.5 km LOS or Line of Sight at the altitude of 300 m and for half an hour with merely a single battery charge. The product also has a CCD camera of high resolution with a zoom and pan/tilt in order to facilitate wider surveillance as well as a thermal camera for visibility during night operations. These images are delivered using a local wireless network for monitoring to laptops. Navigation and flight are independent of user input. They are controlled using an on-board auto-pilot system and anti-collision sensors. Moreover, the user interface provides waypoint navigation where users specify the exact location of the target. After that, the UAV flies to that location automatically. It also has a built-in fail-safe that enables it to return safely to base in case there is a complete loss of communication with its controller and/or if the battery has low power. That said, it cannot operate in the rain yet, and further research is being carried out to make it operable and efficient in all types of weather conditions. During the development stage, ten prototypes were made, and several tests were carried out on them, such as high-altitude and temperature tests. After a few successful trials, it was cleared for induction and production. Now, the developed stage is finished, and ideaForge is completely responsible for carrying out its production. Moreover, ideaForge can manufacture ten units every month. Also, the price of the UAV is said to be anywhere between INR 15-20 lakh. This cost can increase with the purchase of additional components, such as a thermal camera."
						}
					]},
					{	"id" : "3",
						"title" : "Sport-O-Mania Gallery",
						"icon" : "link",
						"subExhibits" : [
							{
								"id" : "0",
								"title" : "Robo_Soccer",
								"icon" : "link",
								"video" : "link",
								"description" : "Robo Soccer : The bots used in robot soccer are model-based reflex AI agents. The basic robot structure consists of 4 Omni-wheels mounted at specific angles on the base plate. The main controller used is Arduino Nano which acts as the brain of the robot. It moves using high torque gear motors as per instructions sent from a central server using the WiFi module. The robots have various sensors and cameras for monitoring feedback. This is sent back to the central server in real-time to generate the next set of actions. The cameras differentiate the robots based on colored markers. These markers are also used to obtain orientation data of the robot. Apart from this, a Solenoid piston is used for kicking and a separate dribbler motor is used for collecting the ball. Specs : Dimensions : Height : 212mm , Diameter : 205mm Weight : 3 Kg Power : 12V (3S) Lipo Battery Frame : Base Frame made of Aluminium and 3D printed Shell made of PLA (Polyactic Acid) Features : High FPS (Frames per second), high resolution machine Vision cameras Pattern detection algorithm to filter the shape, size and orientation of the robots for feedback. Separate Nodes(Programs) for Tactics which defines the gameplay based on the position of ball and Robots. Open Motion Planning Library (OMPL) motion planning software for pathfinding for robots to avoid obstacles."
							},
							{
								"id" : "1",
								"title" : "Robo_Fight",
								"icon" : "link",
								"video" : "link",
								"description" : "Robo Fight : The robot fighter model is a Bioloid GP chosen for it’s aluminum body and servo motors. The aluminum body makes it lightweight. The high-precision servomotors are powerful, precise and easy to command. The configuration is better suited for basic humanoid battle and complex moves. In addition, computer vision is used to detect the state of the robot on the field, so that the robot can know when it is being attacked or has fallen down. To detect this, a camera is installed above the fighting arena which keeps on capturing live feed. A computer program processes these images to determine the status and decide the next move, sending the command through the bluetooth module. This makes the robot-fighters fully autonomous. The robots are simple reflex AI Agents.They can change their centre of gravity which allows them to do manouvers like somersault. The same technology is used in self-driving cars, object recognition and any field where we want to automate tasks dependent on vision. Specifications : Dimension : Height: 346 mm ; Width : 504 mm ; Arm Length : 211 mm ; Leg Length : 182 mm Weight : 1.6 KG Power : 11.1 V 1000 mA Features : Intelligent controller to prevent servo motors from overheating and short circuits. Gyro sensor to adjust its posture while walking. A Bluetooth module is used for wireless communication."
							},
							{
								"id" : "2",
								"title" : "Badminton_Robot",
								"icon" : "link",
								"video" : "link",
								"description" : "Badminton Robot : The robot detects the shuttle-cock by using the depth perception of a stereo camera, which is used to predict the trajectory. Markers provide information about the robot position. Checkerboard calliberation allows the system to identify the robots. Rotary encoders are used to get position feedback. The images captured by the camera are run through a Kalman filter that gives the parameters for deciding the angle of swing. Features : Arduino Mega controller 4 Mechannum-wheels for smooth motion High torque gear motors for locomotion Wi-Fi module(ESP8266) to communicate position data Gyro Sensor for rotary motion feedback High-res cameras for Vision Specs : Dimensions : Height : 760 mm , Width : 850 mm, Length :1560 mm Weight: 10-12 Kg Power: 12V (3S) Lipo Battery."
							},
							{
								"id" : "3",
								"title" : "Air_Hockey",
								"icon" : "link",
								"video" : "link",
								"description" : "Air Hockey : High-resolution machine Vision cameras capture the video in real-time, which goes through pattern recognition and histogram-based filtering in the computer vision algorithm. Inverse Kinematics is used to get servo angles. Prediction of puck trajectory is based on basic trigonometric functions and Kalman filter. Attacking and defense states of the robot are based on the puck velocity and prediction algorithm. OpenCV libraries are used and the bots are coded in python programming language. Specs : Dimensions : Height : 1500mm Length :1250 mm Width : 1250 mm Weight : 90-100 Kg Power : 230V 10A Features : 3 AC Servos to actuate the robotic arm and EtherCAT motor drivers for faster motion. EtherCAT(Ethernet For Control Automation Technology) is an ethernet based field bus system, invented by Beckhoff Automation. Motion protocol for communication with the motor drivers. Raspberry PI processor is used for communication ComputerVision for object detection."
							}
						]},
						{	"id" : "4",
							"title" : "Robo_Natyamandap Gallery",
							"icon" : "link",
							"subExhibits" : [
								{
									"id" : "0",
									"title" : "Robo_Orchestra_&_Robo_Sync_Dance",
									"icon" : "link",
									"video" : "link",
									"description" : "The InMoov is an open-source, 3D printable humanoid invented by Gaël Langevin. Nao is a programmable humanoid by Aldebaran Robotics, now called SoftBank Robotics. Nao has become a standard robot for education and research in humanoid robots. Researchers are particularly interested in the open and fully programmable platform that it offers. The first attempts at dancing Nao's were to showcase it's agile and rhythmic movements, thanks to the 25 degrees of freedom. The dance has since become popular about robotics enthusiasts. It also functions well as an attendant or receptionist, where it uses its microphones and speakers along with speech recognition to interact. It has two 2D cameras and seven touch sensors. Simple modifications have been done to the InMoov robots to make them appear and function like human performers. Servo motors with high torque have been added for playing drums. The hand movement for piano player is achieved using two linear rails and each finger has a dedicated motor. The motion corresponding to the songs is stored as separate files in an SD card. These act as inputs to the Arduino controller based on which the notes are executed by the respective robots. This makes it easier to add songs as the songs need to be uploaded on the serves without changing the base program of the individual robots. The synchronized dance moves are achieved by syncing each and every motor in a universal time frame along with feedbacks of the position of each and every motor to maintain the syncing feature."
								}
							]}


	]

}

														



			
		

			

			
			
			
			
			
		
	
